app/controllers/drinks_controller.rb

	  def create
	    @drink = Drink.new(drink_params)
	    if @drink.save
---
INSERT INTO "drinks" ("title", "description", "category_id", "alcohol_level", "featured", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	  def index
	    if params[:category_id]
	      @category = Category.find(params[:category_id])
	      @drinks = Drink.where(category: @category)
	    else
	      @drinks = Drink.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "drinks".* FROM "drinks" WHERE "drinks"."category_id" = $1  [["category_id", 42]]
SELECT "drinks".* FROM "drinks"