app/controllers/featured_drinks_controller.rb

  def index
    @drinks = Drink.where(featured: true)
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."featured" = 't'