app/controllers/homes_controller.rb

SELECT "drinks".* FROM "drinks" WHERE "drinks"."featured" = 't'
---
  def index
    @drinks = Drink.where(featured: true)